app/views/sessions/new.html.erb

SELECT "users".* FROM "users"
---
	<h2>login</h2>
	<%= User.all.sample.email  %>