app/views/todos/show.html.erb

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 AND "todos"."user_id" = $2 LIMIT $3  [["id", 53], ["user_id", 2], ["LIMIT", 1]]
SELECT SUM(total_allotted_time_in_hours) FROM "todos" WHERE "todos"."user_id" = $1  [["user_id", 3]]
---

	<% todo = Todo.find_by(id: params[:id], user_id: params[:user_id]) %>