app/controllers/sessions_controller.rb

  def create
    # find by downcase email because of validation
    user = User.find_by_email(params[:email].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "b@b.com"], ["LIMIT", 1]]