app/controllers/todos_controller.rb

INSERT INTO "todos" ("user_id", "description", "dependencies", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["description", ""], ["dependencies", ""], ["created_at", "2018-11-10 06:30:27.531419"], ["updated_at", "2018-11-10 06:30:27.531419"]]
UPDATE "todos" SET "calculated_priority" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["calculated_priority", 9.09090909090909], ["updated_at", "2018-11-16 05:30:19.853588"], ["id", 1]]
---
	def create
		params_todo = {
			user_id: current_user.id,
			id: todo_params[:id],
			description: todo_params[:description],
			nominal_priority: todo_params[:nominal_priority],
			allotted_time_in_hours: todo_params[:allotted_time_in_hours],
			dependencies: todo_params[:dependencies]
		}
		todo = Todo.create(params_todo)
		p todo
		if todo.save

UPDATE "todos" SET "nominal_priority" = $1, "allotted_time_in_hours" = $2, "updated_at" = $3 WHERE "todos"."id" = $4  [["nominal_priority", 1], ["allotted_time_in_hours", 100.0], ["updated_at", "2018-11-16 05:08:37.033344"], ["id", 5]]
---
	def update
		@todo.update(todo_params)

DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 4]]
---
	def destroy
		@todo.delete

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 AND "todos"."user_id" = $2 LIMIT $3  [["id", 83], ["user_id", 10], ["LIMIT", 1]]
SELECT SUM(total_allotted_time_in_hours) FROM "todos" WHERE "todos"."user_id" = $1  [["user_id", 3]]
---
	def set_todo
		@todo = Todo.find_by(id: params[:id], user_id: params[:user_id])